{
  "author": {
    "name": "Krish",
    "website": "https://sanguineroyal.com"
  },
  "date": "2025-05-02T19:00:42Z",
  "id": "01JT95YMATPJ7822K7MZD0Z7WH",
  "message": "I love Olivia's album Guts! Most of my favorite songs by her are on this album, although most of my actual favorites are on Guts (Spilled). My top song from the extended album is absolutely So American, it makes me feel so happy every time I hear it. I'm also an Asian-American woman, so thinking about how her British boyfriend probably sees her as the pitome of \"American Girl\" when she's probably spent a lot of her life feeling othered because of her heritage is so sweet to me.....I can literally feel her joy radiating through out. I also love Girl I've Always Been, although I think I prefer the unreleased version of it more. If I have to pick my favorite songs from vanilla Guts, I'd pick Obssessed for something more upbeat, or Lacy for something more thoughtful.\n\nWhen I first heard the single Vampire, I honestly thought that this album wouldn't be for me. It's not bad, but I do tend to skip it. You're in good company in your opinions on this song.",
  "message_html": "<p>I love Olivia’s album Guts! Most of my favorite songs by her are on this album, although most of my actual favorites are on Guts (Spilled). My top song from the extended album is absolutely So American, it makes me feel so happy every time I hear it. I’m also an Asian-American woman, so thinking about how her British boyfriend probably sees her as the pitome of “American Girl” when she’s probably spent a lot of her life feeling othered because of her heritage is so sweet to me…..I can literally feel her joy radiating through out. I also love Girl I’ve Always Been, although I think I prefer the unreleased version of it more. If I have to pick my favorite songs from vanilla Guts, I’d pick Obssessed for something more upbeat, or Lacy for something more thoughtful. </p><p>When I first heard the single Vampire, I honestly thought that this album wouldn’t be for me. It’s not bad, but I do tend to skip it. You’re in good company in your opinions on this song.</p>"
}