[
    {
    "title": "Vriska and Terezi are Bad for Each Other",
    "date": "2023-02-15",
    "content": "\u003Cdiv class=\u0022warning\u0022\u003E\u003Cp\u003EThis is not \u003Cem\u003Esupposed\u003C/em\u003E to be a comically incoherent rant abouthow two fictional characters shouldn’t be shipped, however it is quicklylooking to become that. Also seemingly just a rant about how Vriska wastreated.\u003C/p\u003E\u003Cp\u003ERead at your own digression\u003C/p\u003E\u003C/div\u003E\u003Cp\u003E\u003Cbr /\u003E \u003Cbr /\u003E\u003C/p\u003E\u003Ch2 id=\u0022vriska-is-a-bad-person.\u0022\u003EVriska is a bad person.\u003C/h2\u003E\u003Cp\u003ELet us take a quick moment to acknowledge that Vriska is a badperson.\u003C/p\u003E\u003Cp\u003EShe kills hundreds of people to feed her Lucus, builds a doomsdaymachine for a genocidal maniac, and most importantly, she the amount ofcharacters she has maimed or killed in her friend group is almost equalto the number of trolls she interacted with before the start of Sgrubperiod.\u003C/p\u003E\u003Cp\u003EThat last one is most important for the thesis of this unhinged rant(VrisRezi is bad) for reasons that should be obvious — TEREZI IS ONE OFTHOSE FRIENDS SHE MAIMED.\u003C/p\u003E\u003Cp\u003E\u003C/br\u003E\u003C/p\u003E\u003Cp\u003ENow, some may make and argument that because of her upbringing, thesecrimes can be forgiven, or at least put into context.\u003C/p\u003E\u003Cp\u003ENow, there are many ways I could respond to that. Ranging fromdeliberately inflammatory (What’re your thoughts on [insert human rightviolation here]), utterly dismissive (Who cares loser?), or how Iactually feel.\u003C/p\u003E\u003Cp\u003EI’m gonna go with the last one.\u003C/p\u003E\u003Cp\u003EYes, some of Vriska’s actions can be explained by the context of herupbringing, specifically the first two. She is an upper class caste andthat will warp your world-view, especially if the culture is overallgeared towards violence. However, those crimes are more abstract, theymerely serve as exposition for how bad Alternia is, the last and biggestissue with Vriska’s past is wayyyyyyyy worse and worthy of scorn.\u003C/p\u003E\u003Cp\u003EThat’s not just a human perspective, Vriska experiences a partialshunning from the other trolls for a while. Specifically after themurder of Aradia, the blinding of Terezi and the FORCING ARADIA’S FRIENDTO DEAL THE LETHAL BLOW. All of which was sparked by her disabling ofthe 4th member of her, Aradia, and Terezi’s FLARPing troupe —Tavros.\u003C/p\u003E\u003Cp\u003ETo the other trolls this is fucked up. So no “her society made herlike that” can save her. Only self improvement and introspection canhelp her.\u003C/p\u003E\u003Cp\u003EAlso all of her past crimes working out to her friend’s benefit. Thatalso helped.\u003C/p\u003E\u003Cp\u003EAnd to Vriska’s credit, she does start down the road to selfimprovement with her meeting John and his relentless optimism graduallymaking her realize that living on Alternia fucking sucked and made her abad person\u003Ca href=\u0022#fn1\u0022 class=\u0022footnote-ref\u0022 id=\u0022fnref1\u0022role=\u0022doc-noteref\u0022\u003E\u003Csup\u003E1\u003C/sup\u003E\u003C/a\u003E and she starts to transition intothe first phase of her redemption arc.\u003C/p\u003E\u003Cp\u003EAnd then Hussie shot her arc in the back.\u003C/p\u003E\u003Ch2 id=\u0022everything-is-bad-now\u0022\u003EEverything is bad now\u003C/h2\u003E\u003Cp\u003EGod I’m so sad on what happened to Vriska in act 6.\u003C/p\u003E\u003Cp\u003EEvery possible bad turn happened to her arc. She lost the thing thatwas helping her improve, she started a self indulgent quest, and thenher last fucking interaction before DEUS EX SPIDERGIRL happens is herstarting to date the worst and most selfish of the dead trolls, which isincredible back-sliding.\u003C/p\u003E\u003Cp\u003EHowever, the worst fumble of this iteration is having her and Tereziget back together\u003Ca href=\u0022#fn2\u0022 class=\u0022footnote-ref\u0022 id=\u0022fnref2\u0022role=\u0022doc-noteref\u0022\u003E\u003Csup\u003E2\u003C/sup\u003E\u003C/a\u003E…\u003C/p\u003E\u003Cp\u003EYeah.\u003C/p\u003E\u003Cp\u003EIf you don’t know why this is bad, let me phrase it another way.\u003C/p\u003E\u003Cp\u003ETwo people, who while they were dating ended up either failing toprevent the other from almost killing most of their friend group orbeing the one who almost killed half their friend group, get backtogether despite one of them blinding the other when she broke up withher.\u003C/p\u003E\u003Cp\u003EIts bad, its so bad.\u003C/p\u003E\u003Cp\u003EMy sincere belief is that if Vriska is to end up dating someone itneeds to either be: A) Not a troll, because of Alternia’s negativeimpact on her causing her to do things she deeply regrets [See the endof Act 5 Act 2] or B) Literally anyone besides Aradia, Tavros, orTerezi, for obvious reasons.\u003C/p\u003E\u003Ch2 id=\u0022deus-ex-spidergirl\u0022\u003EDeus Ex Spidergirl\u003C/h2\u003E\u003Cp\u003ESo the retcon happened.\u003C/p\u003E\u003Cp\u003EI’m not unhappy with it in concept. It follows Homestuck’s longhistory of shrugging and doing whatever, that’s how we got the trollsand, for better or worse, that’s how we got the Cherubs. It’s a metaphorfor some literary studies concept I’m too much of a creative writingmajor to get.\u003C/p\u003E\u003Cp\u003EHowever.\u003C/p\u003E\u003Cp\u003ETerezi should not have brought back Vriska in that way. Not only doesit make me feel hella icky for the standard SHE FUCKING BLINDED HERreasons, I also think that Tavros would have done just as well stoppingJade, who was the actual threat on the field.\u003C/p\u003E\u003Cp\u003EHowever, my personal reasons Terezi shouldn’t have thought to bringVriska back aside, Vriska would’ve been useless on the meteor in regardsto solving people’s personal problems.\u003C/p\u003E\u003Cp\u003EThink of it this way, she was, up until Act 5 Act 2, a bad person tohave in the room when you wanted to bring people together and fixpersonal issues. That was never her role, she was a 8itchy wild-card whomostly acted rashly and fucked up shit. That’s how she got to godtier,that’s how she killed the king, and that’s how she created Jack.\u003C/p\u003E\u003Cp\u003EIf you want a person to help people through their relationshipissues, bring one of the voices of positivity back, so uh, Feferi,Nepeta? Possibly Tavros… Okay maybe there are less options than Ithought, but Karkat plus Tavros plus Feferi could probably wrap up thedrinking sub-plot, Gamzee being fucking awful, and everything else thatcame up in a month tops.\u003C/p\u003E\u003Cp\u003ESure that would be harder to do because they don’t have one singlemoment that kills them that can be fixed but, hey, remember that FeferiGodtier ghost that revives Wayward Vagabond? THAT’S STILL A THING, THATNEVER STOPPED BEING A THING, JUST USE YOUR ONE REVIVE THEY GET ON EACHOF THEM! JEGUS FUCKING CHRIST.\u003C/p\u003E\u003Cp\u003EOr whatever, it doesn’t have to be that. Just, it should have beenTavros or a troll good with people, not the one whose characterdevelopment stopped at the end of cascade.\u003C/p\u003E\u003Ch2 id=\u0022closer\u0022\u003ECloser\u003C/h2\u003E\u003Cp\u003EI swear this was supposed to be about VrisRezi not Vriska.\u003C/p\u003E\u003Cp\u003EShe needs a quarantine thread for an article about her. smh\u003C/p\u003E\u003Cp\u003EHonestly, I used to really love VrisRezi. I made the ship name mymaster password for my first password manager. I’ve just grown andrealized that its honestly kind of messed up to have them get backtogether.\u003C/p\u003E\u003Cp\u003EI promise this isn’t some crazed JohnVris shipper making a rant post.Well, I do ship them, but mostly because he was the only character thathad a positive impact on her in the whole comic and they gotshafted.\u003C/p\u003E\u003Cp\u003EAnyways, ship VrisRezi, don’t ship VrisRezi. Just please don’t be adick in the comments.\u003C/p\u003E\u003Cp\u003E\u003Cbr /\u003E\u003C/p\u003E\u003Cp\u003EOH ALSO, VRISKA IS CANONICALLY ATTRACTED TO NIC CAGE! I CAN’T BEILIVEI NEARLY FORGOT TO BRING THAT UP!\u003C/p\u003E\u003Csection id=\u0022footnotes\u0022 class=\u0022footnotes footnotes-end-of-document\u0022role=\u0022doc-endnotes\u0022\u003E\u003Chr /\u003E\u003Col\u003E\u003Cli id=\u0022fn1\u0022\u003E\u003Cp\u003EYeah, not even Vriska will fully buy the “I did nothingwrong because it was the norm on Alternia thing.\u003Ca href=\u0022#fnref1\u0022class=\u0022footnote-back\u0022 role=\u0022doc-backlink\u0022\u003E↩︎\u003C/a\u003E\u003C/p\u003E\u003C/li\u003E\u003Cli id=\u0022fn2\u0022\u003E\u003Cp\u003ESomewhat amusingly while a JohnxVriska ship songs playsin the background.\u003Ca href=\u0022#fnref2\u0022 class=\u0022footnote-back\u0022role=\u0022doc-backlink\u0022\u003E↩︎\u003C/a\u003E\u003C/p\u003E\u003C/li\u003E\u003C/ol\u003E\u003C/section\u003E"
}
]
