[
    {
    "title": "Uncertainty",
    "subseries": "Moving in Together",
    "number": 2,
    "authornote": "<p>Day two of this serial flash fiction experiment.<p>I'm enjoying the process so far, but I'm not sure how sustainable it is for me personally.</p><p>I'm planning on updating the home page for this series to look a bit nicer tommorow after I finish wednesday's entry.</p><p>Ta-ta for now gang!</p>",
    "previous": "Off to college",
    "next": "Machinations",
    "date": "2023-04-10T12:00-05:00",
    "content": "\u003Cp\u003EThe car ride was quiet. Dirk had the wheel of his dingy Honda Civicand had the aux, causing the only sound to be the faint pop music comingfrom the speakers.\u003C/p\u003E\u003Cp\u003E“So bro, you ready for your new life of freedom?”\u003C/p\u003E\u003Cp\u003EDave stared out of the car window at the endless fields of nothingand farmland.\u003C/p\u003E\u003Cp\u003E“Bro? You alive over there.”\u003C/p\u003E\u003Cp\u003EDave continued staring.\u003C/p\u003E\u003Cp\u003E“We’re all we’re gonna have for this next year, you gotta be able totalk to me about things Dave.”\u003C/p\u003E\u003Cp\u003E“Why did you choose Iowa?” His voice was quieter than it was inpublic, like satin to denim, “I’ve been thinking about it for the pastthree hours, but I don’t know the reason that of all the schools inTexas, of all the schools in the \u003Cem\u003Ecountry\u003C/em\u003E, why’d you pick aschool in not even the largest city in Iowa?”\u003C/p\u003E\u003Cp\u003EDirk adjusted the center mirror to look at the car beheind them, “Whyis this weighing on your consious now and not when I applied two yearsago?”\u003C/p\u003E\u003Cp\u003EDave sat in silence, “Because I’m following you now, and John isfollowing me. Your descion matters, it didn’t then. It just was one moreimpulsive descion you’d made in a long line of impulsive descions.”\u003C/p\u003E\u003Cp\u003E“Dude, where’s this coming from? You should have said something whenyou were fucking applying.”\u003C/p\u003E\u003Cp\u003E“Fuck off, I didn’t know John was going to apply to the same collegeas me! He didn’t even ask why I was applying!”\u003C/p\u003E\u003Cp\u003EThe car was silent once again. After two miles clicked by, Dirkfinally replied.\u003C/p\u003E\u003Cp\u003E“I applied because Roxy’s mom works here. She was my only friend bythe end of school so I wanted to be with her.”\u003C/p\u003E\u003Cp\u003E“…is it a good school.”\u003C/p\u003E\u003Cp\u003E“I would have told you to go somewhere else if it wasn’t at leastokay.”\u003C/p\u003E\u003Cp\u003EThe car was silent for a long while after that.\u003C/p\u003E"
},
    {
    "title": "Machinations",
    "subseries": "Moving in Together",
    "number": 3,
    "authornote": "<p>I'm planning on uploading twice tommorow for 4/13. This is a break in my upload schedule but, hear me out, its 4/13 and I need to do <em>something</em>.</p><p>Alternatively, I'll upload a longer short.</p><p>Whatever I do, I'll see y'all tmmrw. :)</p>",
    "previous": "Uncertainty",
    "next": "Terezi's Wierdness is a Universal Constant",
    "date": "2023-04-12T12:00-05:00",
    "content": "\u003Cp\u003ERose wasn't sleeping, not that she ever slept really. A more accurate statement would be that she merely passed out every 18 odd hours.\u003C/p\u003E\u003Cp\u003EIn place of sleep on this specific night, she was shooting off messages to her friends across the United States in younger time-zones, filling the time between their replies with putting digital scrawls into her netbook's meager storage space.\u003C/p\u003E\u003Cp\u003EShe was excited to follow in her sister and mother's footsteps, if not in revolutionizing the scientific disciplines as they aspired to, then by writing a story that would render even the most wretched humans blubbering wrecks of emotion at the sheer brilliance of the story.\u003C/p\u003E\u003Cp\u003ENaturally, she would be enrolling in their school's creative writing program. She would have preferred something farther from home, but going to the school that the two of them already were at would save her the obligation of returning home, leaving her free to pursue excellence.\u003C/p\u003E\u003Cp\u003EShe also couldn't wait for the look on Dave's face when he realized the secret she'd been keeping from him.\u003C/p\u003E\u003Cp\u003EHe had no idea the utter domination that would follow.\u003C/p\u003E"
},
    {
    "title": "Detour to Wendy's",
    "subseries": "Moving in Together",
    "number": 4,
    "previous": "Terezi's Wierdness is a Universal Constant",
    "next": "Meeting the Roommate",
    "authornote": "<p>Blegh, I got absolutly no sleep last night.</p><p>Have a story.</p>",
    "date": "2023-04-14T12:00-05:00",
    "content": "\u003Cp\u003EDave's phone vibrated in his pocket about 40 miles outside the city limits. He took it out and replied to Rose.\u003C/p\u003E\u003Cspan class=\u0022rose\u0022\u003ETT: how close are you to your school\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: about 40 or so miles out\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: why?\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022rose\u0022\u003ETT: im curious\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: yk\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: you never told me where you decided to go\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: you mentioned chicago once\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: and then the rest of the times id ask you gave batshit answers\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: like the moon\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: or fucking r'lyeh or some shit\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022rose\u0022\u003ETT: why ask now?\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: ive had a lot of time to think\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022rose\u0022\u003ETT: well i'm afraid my choice of school isn't very noteworthy\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022rose\u0022\u003ETT: (in an absolute sense at least)\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022rose\u0022\u003ETT: i'm just going to where my mother and dear sweet older sister are\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: so we're in the same boat then\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: no real agency over our actions\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: just drifting\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022rose\u0022\u003ETT: i'm going to punch you for that melodrama\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022rose\u0022\u003ETT: if i wanted to go to a different school i would have\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022rose\u0022\u003ETT: this\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022rose\u0022\u003ETT: is going to be oh so much fun\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022rose\u0022\u003ETT: i'll see you soon, my dear strider\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: yeah ttyl\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: gl with your family and shit\u003C/span\u003E\u003Cbr /\u003E\u003Cp\u003EDave sighed and put his phone to sleep.\u003C/p\u003E\u003Cp\u003EDirk glanced over at him, \u0022Who ya talkin to, bro?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Rose,\u0022 Dave replied, \u0022she's a&#x2026;friend.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Well, that seems convincing,\u0022 Dirk said with a voice saturated with sarcasm, \u0022she your secret girlfriend, or something?\u0022\u003C/p\u003E\u003Cp\u003EDave burst out laughing, \u0022Jesus friggin Christ no! She and I have a purely platonic relationship based on ironic flirting and fucking with the other.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Sounds like a girlfriend,\u0022 Dirk said while adjusting the GPS.\u003C/p\u003E\u003Cp\u003EDave snorted, \u0022Yeah, like you'd know. The year you graduated you were the head of the GSA and organized a Pride Parade.\u0022\u003C/p\u003E\u003Cp\u003E\u0022I coulda been bi.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Are you?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Not telling. You wanna stop at wendy's before we get there?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Why wendy's?\u0022\u003C/p\u003E\u003Cp\u003EDirk chuckled, \u0022There's one a block from the school, so whenever I'd miss dinner for whatever reason, I'd walk through the drive through and order food.\u0022\u003C/p\u003E\u003Cp\u003E\u0022You are&#x2026;something else.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Is that a yes.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Eh, fuckit. Why not?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Hell yeah!\u0022\u003C/p\u003E\u003Cp\u003EDave felt another buzz and quickly replied to the final Rose text of the day.\u003C/p\u003E\u003Cspan class=\u0022rose\u0022\u003ETT: i need your dorm address\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022rose\u0022\u003ETT: so i can send you mail\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: greene 304"
},
    {
    "title": "Meeting the Roommate",
    "subseries": "Moving in Together",
    "number": 5,
    "previous": "Detour to Wendy's",
    "next": "What's up with John right now?",
    "authornote": "<p>The challenge in writing Damara is that she has no characterization besides being mean, horny, and japanese. So no matter what you do you're prone to writing her out of character.</p><p>The solution&mdash;like all of the other times I realize I'm writing out of character&mdash;is to not care about it too much and try to make sure that the characters are at least acting in character <em>internally</em>.</p><p>So that's the reason why [insert character here] doesn't behave exactly like their original self in Homestuck.</p><p>Besides, I just have to stay closer to their characterization than the epilougues and I come out ahead. :P</p>",
    "date": "2023-04-17T12:00-05:00",
    "content": "\u003Cp\u003EThe elevator was silent as Rose ascended.\u003C/p\u003E\u003Cp\u003ERose had poleitly declined her sister's offer to \u0022help her move in,\u0022 as she had been on campus enough times that she could manage by herself, thank you very much. Besides its not like she had more than a small bag to move in with.\u003C/p\u003E\u003Cp\u003EThe elevator dinged and the doors opened to the ninth floor of Murray hall. Rose strolled forward to take a peek through the window.\u003C/p\u003E\u003Cp\u003EThe sight was breathtaking and filled her with feelings of power and bliss. The fact that she could just make out dave's dorm building from the corner of her vision contributed to that feeling.\u003C/p\u003E\u003Cp\u003EAs she stepped back from the window she absently opened her phone to double check her dorm room number one last time.\u003C/p\u003E\u003Cp\u003E903, just like the last four times.\u003C/p\u003E\u003Cp\u003ERose stopped in front of room 903 and delivered a swift and determined rap onto the door.\u003C/p\u003E\u003Cp\u003EThe door cracked open a tiny bit.\u003C/p\u003E\u003Cp\u003E\u0022何これ…\u0022 A voice groaned from beheind the door.\u003C/p\u003E\u003Cp\u003ERose cleared her throat, \u0022My name is Rose Lalonde. I'm going to be your roommate this year. Pleased to make your aquantince.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Fuck,\u0022 The voice said, \u0022come in.\u0022\u003C/p\u003E\u003Cp\u003EThe door opened slowly and Rose got her first look at her new roomate.\u003C/p\u003E\u003Cp\u003EShe seemed to be hungover or, at minimum, was not used to getting up before noon. She was wearing a dark red lipstick and eyeshadow that appeared, from the smearing, to have been applied the previous night. Her eyes, which she was rubbing currently, were reddish brown and her skin was only a shade or two darker than her own. Her hair was black and&#x2014;\u003C/p\u003E\u003Cp\u003ERose felt her face grow warm.\u003C/p\u003E\u003Cp\u003EShe wasn't wearing a top or bra. The only thing covering her&#x2026;Rose's neck twitched&#x2026;ample bust was her long hair.\u003C/p\u003E\u003Cp\u003E\u0022I, um, hello&#x2026;You, forgot,\u0022 she stuttered while gesturing with all the tact of a wilderbeast.\u003C/p\u003E\u003Cp\u003E\u0022Hm?\u0022 The girl murmered, \u0022Oh. Yeah.\u0022\u003C/p\u003E\u003Cp\u003EHaving realized the issue, she swiped a T-Shirt from on top of her bed and put it on. Inadvertantly flashing Rose even more as she did.\u003C/p\u003E\u003Cp\u003E\u0022Yo,\u0022 the girl said, \u0022I'm Damara. I have a splitting headache, so if you can dump your stuff and leave&#x2026;\u0022\u003C/p\u003E\u003Cp\u003E\u0022Um, yes, that's&#x2026;fine.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Aight, see you tonight or whatever.\u0022\u003C/p\u003E\u003Cp\u003ERose carefully set her bag on her bed and left the room significantly less resolute than she entered it.\u003C/p\u003E"
},
    {
    "title": "Off to college",
    "subseries": "Moving in Together",
    "number": 1,
    "authornote": "<p>I'm thinking about experiementing with short form updates on a MWF schedule.</p><p>Let's see how long I last lmao</p>",
    "previous": "Home",
    "next": "Uncertainty",
    "date": "2023-04-07T12:00-05:00",
    "content": "\u003Cp\u003EJohn was excited.\u003C/p\u003E\u003Cp\u003EIn less than 24 hours, he would board a plane and fly to the first day of the rest of his life, to College!\u003C/p\u003E\u003Cp\u003EHe and his best friend in the whole world were finally going to be able to meet irl. He was going to have a college experience just like the movies, surrounded by his friends that he was going to make as soon as he got there.\u003C/p\u003E\u003Cp\u003EHe carefully repacked all of his posters, books, and clothes into his suitcases and got ready once again for the morning. He began pacing around his room making sure every little thing was ready for the next day.\u003C/p\u003E\u003Cp\u003EIf he forgot a single thing, his dad couldn't drive from Washington to Iowa to deliver it, so he needed to get this right.\u003C/p\u003E\u003Cp\u003EAfter he made sure everything was ready, he crawled into bed and tried to fall asleep.\u003C/p\u003E\u003Cp\u003EHe just knew Dave must be just as excited to see him too!\u003C/p\u003E"
},
    {
    "title": "What's up with John right now?",
    "subseries": "Moving in Together",
    "number": 6,
    "authornote": "<p>I would like to thank <a href=\u0022https://en.wikipedia.org/wiki/Spokane_International_Airport\u0022>Wikipedia</a> for its help writing today's story.</p><p>Its been a while since we've seen John, hasn't it. I wonder how many airport focused shorts I can milk out of him to exemplify what going to school in the midwest when you live on the west coast is like.</p><p>Also. Hi Jade.</p>",
    "previous": "Meeting the Roommate",
    "next": "Terezi plays chess",
    "date": "2023-04-19T12:00-05:00",
    "content":"\u003Cp\u003EA small family of three&#x2014;a smartly dressed single father and his twin children&#x2014;sat in the Spokane International Airport’s A concourse while eating sandwhiches.\u003C/p\u003E\u003Cp\u003E\u0022Now boarding flight 413620 to Denver Colorado. Repeat, now boarding flight 413620 to Denver Colorado.\u0022\u003C/p\u003E\u003Cp\u003EThe father stood up and clapped his hands together, \u0022Alright gang! Ready to head off into a new tommorow?\u0022\u003C/p\u003E\u003Cp\u003EThe twins, John and Jade, rolled their eyes in sync.\u003C/p\u003E\u003Cp\u003E\u0022Now, now,\u0022 he continued, \u0022this is an excedingly important time in a young man and woman’s life.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Dad,\u0022 John said, \u0022that’s what you tell us when we’re checking into our dorms&#x2026;\u0022\u003C/p\u003E\u003Cp\u003E\u0022Not when we’re boarding the plane to the layover,\u0022 Jade finished.\u003C/p\u003E\u003Cp\u003E\u0022Pish posh! Every step on your journey matters!\u0022\u003C/p\u003E\u003Cp\u003EThe twins smiled to themselves, gathered their bags, and followed their dad into his new tommorow.\u003C/p\u003E"
},
    {
    "title": "The First Day of the Rest of Our Lives.",
    "subseries": "Moving in Together",
    "number": 9,
    "authornote": "<p>Bit of a shorter one today. The main explanation is that I've been trapped in finals all week and am moving out tmmrw.</p><p>See you Friday!</p>",
    "previous": "Room 304",
    "date": "2023-05-03T23:40-05:00",
    "next": "Rose",
    "content": "\u003Cp\u003EJohn Egbert stood on the other side of the door holding a single suitcase.\u003C/p\u003E\u003Cp\u003EDave slowly unlatched the door and pulled it open towards himself. John had a massive smile on his face.\u003C/p\u003E\u003Cp\u003EHe said something but Dave couldn't hear through the rush of blood in his head.\u003C/p\u003E\u003Cp\u003EDave stumbled forward and wordlessly hugged John, squeezing him tight to reassure himself that he wouldn't leave.\u003C/p\u003E\u003Cp\u003EJohn nestled under Dave's chin and Dave could feel him say something else from the vibration.\u003C/p\u003E\u003Cp\u003EThe two broke the hug and John brought his bag into their new home for the next year.\u003C/p\u003E"
},
    {
    "title": "Room 304",
    "subseries": "Moving in Together",
    "number": 8,
    "authornote": "<p>I'm back!</p><p>Sorry for the micro hiatus, finals plus getting sick kinda floored me for a little.</p><p>We're back to our regularly scheduled programming now though! :)</p>",
    "previous": "Terezi plays chess",
    "next": "The First Day of the Rest of Our Lives.",
    "date": "2023-05-01T12:00-05:00",
    "content": "\u003Cp\u003EDave unlocked the door of his dorm room and moved his bags into the room.\u003C/p\u003E\u003Cp\u003EHe seemed to be the last person on the floor to move into his dorm. He knew it couldn't be true&#x2014;uperclassmen moved in the day after&#x2014;but no one else akwardly had their bags in the hall as they struggled with the deadbolts and that fact alone felt isolating.\u003C/p\u003E\u003Cp\u003E\u0022Fuck.\u0022\u003C/p\u003E\u003Cp\u003EJohn still wasn't here.\u003C/p\u003E\u003Cp\u003EThe last Dave heard from him, he had just landed in the Eastern Iowa Airport and was taking the Uber to the school. Dave threw a punch into the air. \u003Ci\u003EI am not ready for this.\u003C/i\u003E\u003C/p\u003E\u003Cp\u003ESure, he had been looking forward to meeting John for years at this point, but&#x2026;\u003C/p\u003E\u003Cp\u003EDave began pacing.\u003C/p\u003E\u003Cp\u003E\u003Ci\u003EFuck.\u003C/i\u003E\u003C/p\u003E\u003Cp\u003EDespite Dirk's reassurences, he still wasn't sure John going to this school was a good idea.\u003C/p\u003E\u003Cp\u003E\u003Ci\u003EI should have pushed back harder&#x2026;\u003C/i\u003E\u003C/p\u003E\u003Cp\u003EDave sat down on rightmost the bed and let himself fall onto his back.\u003C/p\u003E\u003Cp\u003EHe stared at the ceiling and felt the minutes drift by.\u003C/p\u003E\u003Cp\u003EThen, he heard a knock on his door.\u003C/p\u003E\u003Cp\u003EIt was time.\u003C/p\u003E"
},
    {
    "title": "Rose",
    "subseries": "Moving in Together",
    "number": 10,
    "authornote": "<p>I'm writing this author's note in Des Moines on my way to Burbank California.</p><p>Enjoy! :)</p>",
    "previous": "The First Day of the Rest of Our Lives.",
    "next": "Damara makes a Chai",
    "date": "2023-05-05T12:00-05:00",
    "content": "\u003Cp\u003EThe other side of the door stood a short haired girl wearing a grey sweater, a pleated skirt, and cherry red makeup.\u003C/p\u003E\u003Cp\u003E\u0022Who are you?\u0022\u003C/p\u003E\u003Cp\u003EThe girl smiled, \u0022Why, my dear David, you don’t recognize me? I would have thought after 8 years you’d know your friends, be they online or real life.\u0022\u003C/p\u003E\u003Cp\u003EDave stared at her.\u003C/p\u003E\u003Cp\u003EShe sighed, \u0022My name is Rose Lalonde. We have been online friends since we were in elementary school.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yeah,\u0022 Dave said while scratching the back of his head, \u0022I kinda don’t buy that. At most Rose told you to prank me.\u0022\u003C/p\u003E\u003Cp\u003E\u0022I&#x2026;\u0022 Rose said, \u0022Why don’t you believe me! I’m Rose! Your friend!\u0022\u003C/p\u003E\u003Cp\u003E\u0022Listen Ma’am,\u0022 Dave said, \u0022you don’t look like Rose. Rose has long hair and dresses like a reject from Hot Topic. In addition to that, the likelyhood of Rose going this far for a joke is dumb. So you’re not her.\u0022\u003C/p\u003E\u003Cp\u003EThe two stared at each other for a moment before Rose broke down and burst out laughing.\u003C/p\u003E\u003Cp\u003E\u0022Hahaha, I&#x2026;I can’t believe it. My schemes cancelled themselves out.\u0022\u003C/p\u003E\u003Cp\u003EShe grabbed her wallet from a skirt pocket and fished out her State ID. Rose Lalonde, Iowa.\u003C/p\u003E\u003Cp\u003E\u0022I am Rose Lalonde.\u0022\u003C/p\u003E\u003Cp\u003EDave blinked at her, \u0022Then why do you look like&#x2026;un-gothy.\u0022\u003C/p\u003E\u003Cp\u003E\u0022I thought it would be humourous if I changed up my appearence to shock you. Well, that and the fact that I’ve changed my outlook on life since freshman year of highschool.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Okay, sure. Makes sense and all that shit, but why are you here? Like, surely you wouldn’t follow me to this school as a joke. I know you have aspirations and shit.\u0022\u003C/p\u003E\u003Cp\u003EShe sighed, \u0022It was honestly a coincidence. My mother and and sister were already here, so I followed them.\u0022\u003C/p\u003E\u003Cp\u003E\u0022So, the same reason I’m here.\u0022 He said. \u0022Whoo legacy hire,\u0022 he added flatly.\u003C/p\u003E\u003Cp\u003E\u0022Indeed.\u0022\u003C/p\u003E\u003Cp\u003EDave sighed, \u0022Hi Rose.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Hello Dave.\u0022\u003C/p\u003E\u003Cp\u003E\u0022I ruined your joke, didn’t I?\u0022\u003C/p\u003E\u003Cp\u003ERose smiled, \u0022Perhaps, but the bulk of the joke was the slow realization that you’ll have to deal with me for four years.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yeah, assuming we don’t drive each other crazy.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Or anyone else for that manner.\u0022\u003C/p\u003E\u003Cp\u003EThey smiled at each other for a moment before Dave started again, \u0022Come on, lemme introduce you to John.\u0022\u003C/p\u003E"
},
    {
    "title": "Terezi plays chess",
    "subseries": "Moving in Together",
    "number": 7,
    "authornote": "<p>Terezi Gaming.</p><p>Bit of a lighter update today, I ended up taking three tests today and it sapped my motivation to write.</p><p>See y'all monday.</p>",
    "previous": "What's up with John right now?",
    "next": "Room 304",
    "date": "2023-04-21T12:00-05:00",
    "content": "\u003Cp\u003EAt the tender hour of 3:30 AM, Terezi had her laptop and an internet chess program.\u003C/p\u003E\u003Cdiv class=\u0022chat\u0022\u003E--- turntechGodhead has joined the room ---\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: hey\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022terezi\u0022\u003EGC: h3y\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: still doing the lame 314 gimmick\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022terezi\u0022\u003EGC: 4r3 you st1ll too dumb to p4ss 4lg3br4\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: fair 'nough\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: lets get this done\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: ive gotta move into my dorm later\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022terezi\u0022\u003EGC: you could h4v3 just 4sk3d to pl4y l4t3r\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: no no\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: i need to take my mind off some stuff\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022terezi\u0022\u003EGC: ok4y\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022terezi\u0022\u003EGC: pr3p4r3 to h4v3 your 4ss h4nd3d to you\u003C/span\u003E\u003Cbr /\u003E\u003C/div\u003E\u003Cp\u003ETerezi started the match and the two settled down into the same rhythm that they always did during these games.\u003C/p\u003E\u003Cp\u003EWell, they'd only been playing each other since they first met, nearly 5 months ago when their families booked the same time slot for a school tour. The two had hit it off and exchanged contact information.\u003C/p\u003E\u003Cp\u003ESomehow they managed it without learning each others names.\u003C/p\u003E\u003Cdiv class=\u0022chat\u0022\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: god dammit\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022terezi\u0022\u003EGC: \u003E:}\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022terezi\u0022\u003E* gallowsCalibrator sm1rks 4t TG.\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: aye\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: gg gc\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022terezi\u0022\u003EGC: gg\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022terezi\u0022\u003EGC: do you w4nt to t4lk 4bout th3 \u0022stuff?\u0022\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: no\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: sorry\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: maybe tmmrw okay\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022terezi\u0022\u003EGC: 1 und3rst4nd\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022terezi\u0022\u003EGC: good luck mov1ng 1n\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022terezi\u0022\u003EGC: l3ts m33t 1n p3rson n3xt w33k\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022terezi\u0022\u003EGC: d34l?\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: i can do that\u003C/span\u003E\u003Cbr /\u003E\u003Cspan class=\u0022dave\u0022\u003ETG: deal\u003C/span\u003E\u003Cbr /\u003E--- turntechGodhead has left the room ---\u003C/div\u003E"
},
    {
    "title": "Terezi's Wierdness is a Universal Constant",
    "authornote": "<p>Woooo! 4/13!</p><p>Have a Terezi and Vriska triple feature.</p><p>Regularly scheduled uploads resume tommorow with John flying to Iowa.</p><p>See ya!</p>",
    "previous": "Machinations",
    "next": "Detour to Wendy's",
    "date": "2023-04-13T12:00-05:00",
    "content": "\u003Cdiv id=\u0022outline-container-org3d5f1a2\u0022 class=\u0022outline-2\u0022\u003E\u003Ch2 id=\u0022org3d5f1a2\u0022\u003E\u003Cspan class=\u0022section-number-2\u0022\u003E1.\u003C/span\u003E Very Normal Dorm Decor\u003C/h2\u003E\u003Cdiv class=\u0022outline-text-2\u0022 id=\u0022text-1\u0022\u003E\u003Cp\u003ETerezi Pyrope paced back and forth considering every angle. She needed to get a holistic view of her decorations if she was to craft a perfect display of her personality.\u003C/p\u003E\u003Cp\u003EOnce she had examined every inch of her side of her dorm room, she got to work tying the ropes for her masterpiece.\u003C/p\u003E\u003Cp\u003E20 minutes later, she was done. It was a perfect display of her inner self, of how she saw the world.\u003C/p\u003E\u003Cp\u003E\u0022You know, Rezi,\u0022 her roommate, having just walked in, said, \u0022the hanged stuffies makes it pretty difficult for me to bring anyone to our dorm.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Hehehe,\u0022 she cackled, \u0022then my plan is succes&#x2014;ow!\u0022\u003C/p\u003E\u003Cp\u003EShe nursed the bruise on her forhead as Vriska picked back up her book and left the dorm.\u003C/p\u003E\u003C/div\u003E\u003C/div\u003E\u003Cdiv id=\u0022outline-container-org106c8d6\u0022 class=\u0022outline-2\u0022\u003E\u003Ch2 id=\u0022org106c8d6\u0022\u003E\u003Cspan class=\u0022section-number-2\u0022\u003E2.\u003C/span\u003E  Ascii\u003C/h2\u003E\u003Cdiv class=\u0022outline-text-2\u0022 id=\u0022text-2\u0022\u003E\u003Cp\u003EIn the early hours of the morning, Vriska woke up and groped in the darkness for her glasses.\u003C/p\u003E\u003Cp\u003E\u0022Ugh, this never gets easier,\u0022 she mumbled as she found them and brought them under her covers.\u003C/p\u003E\u003Cp\u003E\u0022Ow, fucking jackass,\u0022 she said as she poked herself in the eye.\u003C/p\u003E\u003Cp\u003EOnce she got them on she steeled herself momentarily before throwing off her blanket and getting out of her bed.\u003C/p\u003E\u003Cp\u003E\u0022Morning 'Rezi,\u0022 she said while rubbing her eyes, still groggy.\u003C/p\u003E\u003Cp\u003ETerezi didn't look up from her laptop. She had been gaming all night and had her headphones on.\u003C/p\u003E\u003Cp\u003E\u0022Yo 'Rezi,\u0022 Vriska pulled off her headphones and then promptly dropped them in horror.\u003C/p\u003E\u003Cp\u003E\u0022&#x2026;PERIOD PERIOD PERIOD PERCENT WHITE BOLD NUMBER BLUE PERIOD PERIOD PERIOD&#x2026;\u0022\u003C/p\u003E\u003Cp\u003E\u0022WHAT THE ACTUAL FUCK ARE YOU LISTENING TO. IT SOUNDS LIKE A ROBOT MANIFESTO.\u0022\u003C/p\u003E\u003Cp\u003ETerezi turned around to look up at her roommate, \u0022Oh good morning Vriska.\u0022\u003C/p\u003E\u003Cp\u003ETerezi's smiling face broke Vriska, \u0022H-how, what the hell&#x2026;\u0022\u003C/p\u003E\u003Cp\u003E\u0022Oh, this?\u0022 Terezi tapped her headphones, \u0022I'm blind so I use a screen reader to play games in my terminal, it reads me every character on screen so I know where everything is.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Bullshit. That's Bullshit, that cannot be how that works.\u0022\u003C/p\u003E\u003Cp\u003ETerezi grinned, \u0022Oh? Whatcha gonna do? Prove me wrong? Prove I don't play all my games this way? Howdju expect to do that, Vrissy?\u0022\u003C/p\u003E\u003Cp\u003EVriska stared at her for a few minutes and left the dorm, disturbed and afraid.\u003C/p\u003E\u003C/div\u003E\u003C/div\u003E\u003Cdiv id=\u0022outline-container-org03a029e\u0022 class=\u0022outline-2\u0022\u003E\u003Ch2 id=\u0022org03a029e\u0022\u003E\u003Cspan class=\u0022section-number-2\u0022\u003E3.\u003C/span\u003E Do it yourself\u003C/h2\u003E\u003Cdiv class=\u0022outline-text-2\u0022 id=\u0022text-3\u0022\u003E\u003Cp\u003EThe sewing machine thrumming with rhythmic simplicity was the only sound in the library.\u003C/p\u003E\u003Cp\u003EAs soon as she finished the stich she was working on, Terezi swiftly double tapped the watch on her wrist, causing it vibrate the time in morse code. 23:30.\u003C/p\u003E\u003Cp\u003EShe frowned, she was up later than she had planned and she only was halfway done with Cherrytongue's body.\u003C/p\u003E\u003Cp\u003EShe sighed and shut off the sewing machine, the library was closing in a half hour and she'd rather stop at this natural break rather than be forced to abandon her work later.\u003C/p\u003E\u003Cp\u003EShe could finish tommorow anyways.\u003C/p\u003E\u003C/div\u003E\u003C/div\u003E"
},
    {
    "title": "Damara makes a Chai",
    "date": "2023-05-10T12:00-05:00",
    "tags": ["collegestuck", "shorts"],
    "previous": "Rose",
    "next": "",
    "authornote": "",
    "content": "\u003Cp\u003E\u0022Uuugh,\u0022 Damara groaned through her blankets.\u003C/p\u003E\u003Cp\u003EAfter suffering a few minutes of her headache, she groped for her phone on her minifridge she was using as a bedside table. She found a scrap of paper instead and pulled it under her blanket to read.\u003C/p\u003E\u003Cp\u003E\u0022Hello Damara,\u0022 it read, \u0022judging from your level of intoxication, I have determined that you’re likely to be hungover this morning. I have taken the inititive to disable your alarm clock and given you an advil from my stash on your desk. I’m with Dave at the library if you need me. See you tonight, and have a good saturday.\u0022\u003C/p\u003E\u003Cp\u003EDamara groaned silently at her roommate’s well meaning bullshit. She shielded her eyes, slithered out of her bed, and made her way to shut the blinds.\u003C/p\u003E\u003Cp\u003EAcomplishing her task, she got the ingrediants out for her hangover ritual while bemoaning silently the fact that this happened enough times that she had one. She fired up the electric hotplate that was&#x2026;dubiously allowed in the dorm and made herself a turmuric chai.\u003C/p\u003E\u003Cp\u003EShe sipped the tea in complete darkness mentally prepared herself for the day.\u003C/p\u003E"
}
]
