[
    {
    "title": "Joe, that is the most self-obvious piece of advice I've ever heard",
    "date": "2023-05-18T14:36-07:00",
    "previous": "home",
    "next": "One more class of the same people talking about the same things for an hour.",
    "number": 1,
    "authornote": "\u003Cp\u003EHowdy!\u003C/p\u003E\u003Cp\u003E  I’m still working on Collegestuck right now (hopefully the next storyline should be written fully by Sunday), but I’m going to be interspersing those uploads with the story I wrote for my creative writing class last year. The topic of the class was \u0022Coming of age.\u0022\u003C/p\u003E\u003Cp\u003ECurrent plain is to serialize it on a Tuesday/Thursday schedule&mdash;leaving MWF free for collegestuck.\u003C/p\u003E\u003Cp\u003EEnjoy!\u003C/p\u003E",
    "content": "\u003Cp\u003EThe difference between the first day of the first and last years ofmiddle school is immense.  The start of your first year is the mostimportant day in your life, and the start of the last year is the mostunimportant.\u003C/p\u003E\u003Cp\u003EJoseph Warren had long since been through his first year of middleschool and was advising his younger sister, Rosie, on how to geteverything she could out of the first day of school, while theylounged on their living room couch.\u003C/p\u003E\u003Cp\u003E\u0022The last thing you want to do is glue yourself to the people youknew in elementary school.  The world is bigger than that now.\u0022\u003C/p\u003E\u003Cp\u003EJoe spoke with the authority of a professor that was giving a lectureon the most important branch of the physical sciences.  An impressionthat Rosie upheld with the rigid dedication of a Harvard student.\u003C/p\u003E\u003Cp\u003ERosie politely raised her hand, \u0022How do you reccomend meeting thesenew people?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Mostly through your classes,\u0022 Joe answered, \u0022I'd also advise onjoining at least one club.  I never did that, but everyone else tellsme that they made their best friends in some-club-or-other.\u0022\u003C/p\u003E\u003Cp\u003ERosie nodded in contemplation, carefully considering what her olderbrother said.\u003C/p\u003E\u003Cp\u003EJoe carried on with his lesson, \u0022Something that I undervalued backwhen I was starting out was showing up to classes.  I didn't think itwould be that hard to do&#x2014;\u0022\u003C/p\u003E\u003Cp\u003ERosie's eyes widened, \u0022You cut classes?\u0022\u003C/p\u003E\u003Cp\u003EJoe immediently backpedaled, \u0022Oh no no no no! I could never! Butdespite my pleading, all of my former friends succumbed to thedisease.\u0022\u003C/p\u003E\u003Cp\u003ERosie giggled, \u0022You're trying to make yourself sound smart again&#x2026;\u0022\u003C/p\u003E\u003Cp\u003EJoe rolled his eyes, \u0022It's to convey the importance of the things Ilearned by attending school, Rosie, I wanna make sure you stay ontrack to kick this school's ass both physically and timemanagement&#x2026;ly.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Nice one, bro\u0022\u003C/p\u003E\u003Cp\u003E\u0022Oh, shut up.  I was trying to tell you that you shouldn't cutclass!\u0022\u003C/p\u003E\u003Cp\u003ERosie rolled her eyes, all traces of a mock-professor/student dynamichaving faded into the mundanity of sibling dynamics.\u003C/p\u003E\u003Cp\u003E\u0022Anyways,\u0022 Joe continued, \u0022don't be an asshole to people you don'tknow.  It gets more blurry with your friends, but I'd reccomend notsaying anything too mean to them as well.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Joe, that is the most self-obvious piece of advice I've everheard,\u0022 Rosie said, \u0022is the next nugget gonna be \u0022don't murder yourteachers\u0022 or something like that.\u0022\u003C/p\u003E\u003Cp\u003EJoe snorted, \u0022Oh yeah, little miss swiping at my back when I'mpicking up my sword, you can be ruthless sometimes.\u0022h\u0022Only to people who deserve to know that what they said was asinineas hell,\u0022 Rosie said, \u0022and I apologized for the backstab already,Jesus Christ Joe.\u0022\u003C/p\u003E\u003Cp\u003EJoe grinned, \u0022Relax Rosie, I'm kidding.\u0022\u003C/p\u003E\u003Cp\u003EThere was a long pause as a look of worry knit itself across Rosie'sface.\u003C/p\u003E\u003Cp\u003ERosie sighed and finally spoke up, \u0022Hey Joe?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yeah?\u0022\u003C/p\u003E\u003Cp\u003EShe paused for a moment before continuing, \u0022Should I try to givemyself a new nickname? Rosie just feels so childish and youngsounding.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Uh,\u0022 Joe leaned back further into the couch's pile of pillows andblankets as if he could escape his uncertainty, \u0022I don't know.  Ikind of know where you're coming from, if that helps at all.  Joeisn't exactly the coolest name in the book, and Joey and Joseph aren'ta whole lot better.\u0022\u003C/p\u003E\u003Cp\u003EShe ran her fingers through her hair distractedly, \u0022Does it reallymatter what my nickname is? Am I over-thinking it?\u0022\u003C/p\u003E\u003Cp\u003EFrom the pillows, Joe said, \u0022I don't think it matters a whole lot,honestly.  I guess as long as you stay true to who you are andwhatever.  Names have power, but as long as the label you stick onyourself doesn't subsume your very \u0022\u003C/p\u003E\u003Cp\u003E\u0022Joe?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yeah?\u0022\u003C/p\u003E\u003Cp\u003E\u0022That was the most incoherent self-indulgy monologue I've heard in along time.  Have you been thinking a lot about this?\u0022\u003C/p\u003E\u003Cp\u003E\u0022No,\u0022 Joe started, \u0022maybe.  I said it before, Joe is a bit of a lamename.  It gives the impression of a middle age football coach whopeaked in high-school.\u0022\u003C/p\u003E\u003Cp\u003E\u0022You're young, there's still time for that\u0022\u003C/p\u003E\u003Cp\u003EJoe got out of the cushions and half heartedly swiped at his sister.\u003C/p\u003E\u003Cp\u003E\u0022Shut up.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Never,\u0022 she said, \u0022anyways.  What about Rose?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Huh? Oh right.\u0022\u003C/p\u003E\u003Cp\u003EJoe thought for a few moments before nodding his head in approval.\u003C/p\u003E\u003Cp\u003E\u0022I like Rose, it feels clever.\u0022\u003C/p\u003E\u003Cp\u003ERose beamed and said, \u0022Like me!\u0022\u003C/p\u003E\u003Cp\u003EJoe ignored the comment, \u0022Do you think I should take on a nicknametoo? I know its really too late to, but I've got a strange feelingthat I ought to, you know?\u0022\u003C/p\u003E\u003Cp\u003ERose considered her words carefully before speaking again, \u0022I thinkthat's a personal question, Joe.  Besides, its not really too late.You can always adopt a screenname, seperate from your own to useonline.\u0022\u003C/p\u003E\u003Cp\u003EJoe sighed and ran his hand through his hair.\u003C/p\u003E\u003Cp\u003E\u0022Yeah you're right,\u0022 Joe said, \u0022I'll leave it be for the year, andif I come up with an ingenious idea that'll blow everyone's minds withhow cool it is I'll use it next year.\u0022\u003C/p\u003E\u003Cp\u003ERose punched Joe's shoulder, and said, \u0022That's the spirit.  Justdon't forget your advice.  What was it? Don't let the nickname becomea mask that become all that you are or whatever that means.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Oh shut up, Rosie.\u0022\u003C/p\u003E"
},
    {
    "title": "One more class of the same people talking about the same things for an hour.",
    "date": "2023-06-06T20:14-07:00",
    "previous": "Joe, that is the most self-obvious piece of advice I've ever heard",
    "number": 2,
    "authornote": "\u003Cp\u003EHowdy!\u003C/p\u003E\u003Cp\u003ESay hello to Jess everybody! I wanted to use her more but the first draft deadline made me cut half of my outline! She was originally supposed to have this convoluted plotline with Joe and the final main character, but I cut that in favor of&#x2026;\u003C/p\u003E\u003Cp\u003E\u003Cb\u003EChecks ahead\u003C/b\u003E\u003C/p\u003E\u003Cp\u003EAn ending that I am disatisfied with to the point that I straight up might rewrite it for this edition.\u003C/p\u003E\u003Cp\u003EWhatever.\u003C/p\u003E\u003Cp\u003EAlso, eagle eyed readers may spot that I was playing Deus Ex for the first time instead of working on the first draft from a little name cameo from JC Denton.\u003C/p\u003E\u003Cp\u003EReal talk guys, names are so fucking hard. Its hard for main characters, but its somehow even harder for throw away characters you never actually see.\u003C/p\u003E\u003Cp\u003EI actually got feedback on this chapter that all of my characters don't sond like middle schoolers. This was the fairest critism I have ever received.\u003C/p\u003E\u003Cp\u003EUgh, rereading this chapter&#x2026;its fine&#x2026;I'm not thrilled with it, but like, it was adequate.\u003C/p\u003E\u003Cp\u003ESee you guys tmmrw.\u003C/p\u003E",
    "content": "\u003Cp\u003EJoe entered his history classroom the next day exhausted from a busyday of learning the conflicting expectations that his teachers wouldbe piling onto him for the remainder of the year.  As he entered theroom, he didn't expect anything less than more of the same.\u003C/p\u003E\u003Cp\u003EJust one more class of the same people talking about the same thingsfor an hour.\u003C/p\u003E\u003Cp\u003EHe spotted one of his friends and plopped himself down in the adjacentdesk, safe in the knowledge that he'd at least have one person in thisclass he could talk to.\u003C/p\u003E\u003Cp\u003E\u0022Hiya, Jess.\u0022\u003C/p\u003E\u003Cp\u003EJessica Yamagawa waved to Joe without taking her head off the desk she was laying on.\u003C/p\u003E\u003Cp\u003E\u0022How's your day been, Jess?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Blegh,\u0022 Jess said, \u0022I've gotten all of the bad teachers.  All of them!\u0022\u003C/p\u003E\u003Cp\u003EJoe rolled his eyes, \u0022I doubt you have \u003Ci\u003Eall\u003C/i\u003E of the bad teachers considering you can only have six teachers at a time, and you haven't even met the last one yet.\u0022\u003C/p\u003E\u003Cp\u003EJess picked her head up off the desk and glared at Joe, her dark brown hair still plastered to the side of her face.\u003C/p\u003E\u003Cp\u003E\u0022Fine then, jackass.  I haven't gotten \u003Ci\u003Eall\u003C/i\u003E the bad teachers, but I'd sure say that all of the ones I've \u003Ci\u003Ehad\u003C/i\u003E today are bad.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Whoemst've?\u0022\u003C/p\u003E\u003Cp\u003EJess sighed and brushed her hair back behind her ear.  After that, she reached into her open backpack and pulled out her schedule.\u003C/p\u003E\u003Cp\u003E\u0022Bio, Max Roberts; English, Lillian Bonner; PE, James Hernando; Spanish, Rosalina Fernandez; and Algebra 2, Olivia Denton,\u0022 she read off the list monotonically, without a shred of intrest in her voice..\u003C/p\u003E\u003Cp\u003E\u0022Why are they the worst then? Your tone and face reflect more apathy than antipathy.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Roberts, Hernando, and Fernandez are dull and lifeless,\u0022 Jess said without pause as she counted the names off on her fingers, \u0022Denton can't be bothered to answer questions about our syllabus, which leaves me little confidence that she won't just let us loose on polynomials with little more than a prayer to help us with them,\u0022 Jess took a breath, \u0022and finally and worstly, I've heard that Bonner doesn't look on people like me with kind eyes.  It's just a rumor, but one I'm not thrilled about figuring out the truth behind.\u0022\u003C/p\u003E\u003Cp\u003EJoe looked visibly distressed at the final statement, \u0022Jesus Jess. Is there anything I can do?\u0022\u003C/p\u003E\u003Cp\u003EJess sighed, \u0022I doubt it.  If it turns out that she's a shit person I'll record it and file a complaint with the school, either they deal with the problem or transfer me to a different class to shut me up. So I'll be fine.\u0022\u003C/p\u003E\u003Cp\u003E\u0022I,\u0022 Joe held a conflicted expression on his face, \u0022trust you.  And I trust you to know what to do and how to do it.  So I'll drop it for now.  But if it does come to that or anything else, please let me know, okay?\u0022\u003C/p\u003E\u003Cp\u003EJess grinned slightly, \u0022Thanks Joe, I appreciate it.  Don't worry \u003Ci\u003Etoo\u003C/i\u003E much though.  More than likely she'll either be a tolerable annoyance, or the rumors will just be the standard level of true rumors are.\u0022\u003C/p\u003E\u003Cp\u003EThe two sat in silence for a few moments.  Joe took the opportunity to get his supplies for class out.\u003C/p\u003E\u003Cp\u003EHe placed his notebook, mechanical pencil, erasers, and pen onto his desk as neatly and deliberately as he could manage.  Everything was to be placed in a coherent manner that allowed for easy access.\u003C/p\u003E\u003Cp\u003EJoe looked around the room in order to figure out who he would be dealing with the rest of the year for sixth period.  It was all the standard people he had been acquainted with for two years now.\u003C/p\u003E\u003Cp\u003EActually, there was a new person he hadn't seen before.\u003C/p\u003E\u003Cp\u003EJoe knew he didn't know every single person his grade level in the school, but he had never seen this girl's face before in the two years he had been at the school.\u003C/p\u003E\u003Cp\u003E\u0022Jess.\u0022\u003C/p\u003E\u003Cp\u003ENo response.\u003C/p\u003E\u003Cp\u003E\u0022Hey, Jess,\u0022 Joe repeated, this time with a poke accompanying the vocalization.\u003C/p\u003E\u003Cp\u003E\u0022What?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Do you see the girl in the corner? The one with the longer blonde hair that isn't done up? She's reading a book right now.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yeah? What about her?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Do you know who she is?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Fuck if I know, Joe,\u0022 Jess squinted, \u0022oh wait, she has math with me&#x2026; her name's Robyn Something.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Strange last name.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Oh fuck off,\u0022 Jess replied to the jab with little irritation, \u0022I'm not like you, I don't spend my class staring at dorks.  Anyways, why'd you ask?\u0022\u003C/p\u003E\u003Cp\u003E\u0022I haven't seen her before,\u0022 Joe replied susinctly, \u0022I was wondering if she's new.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Ah yes, classic Joe,\u0022 Jess drily noted, \u0022\u003Ci\u003EI don't recognize this person, they must be from somewhere  else!\u003C/i\u003E\u0022\u003C/p\u003E\u003Cp\u003E\u0022Hey!\u0022\u003C/p\u003E\u003Cp\u003E\u0022I'm teasing you, relax dude.\u0022\u003C/p\u003E\u003Cp\u003EThey were both smiling now, lightly ribbing each other in a dance of friendship.\u003C/p\u003E\u003Cp\u003EThis dance was interrupted by their teacher walking in.  The teacher began introducing herself and in doing so had consequently begun the mundanity and boredom in Joe's mind.\u003C/p\u003E\u003Cp\u003EEvery now and then though, he snuck glances at the new girl, Robyn.\u003C/p\u003E\u003Cp\u003EShe had an energy about her, one that gave off the impression of disinterest in what outsiders thought of her, of subtle confidence, of being \u0022too cool for school.\u0022\u003C/p\u003E\u003Cp\u003EThe way she carried herself, the way she moved her hair, the way she smirked when she pushed up her aviator shaped glasses, all of it contributed to an undeniable mystique.\u003C/p\u003E\u003Cp\u003EAnd before he knew it, Jess was tapping his shoulder and the day was done.\u003C/p\u003E"
}
]
