[
    {
    "title": "Joe, that is the most self-obvious piece of advice I've ever heard",
    "date": "2023-05-18T14:36-07:00",
    "previous": "home",
    "next": "",
    "number": 1,
    "authornote": "\u003Cp\u003EHowdy!\u003C/p\u003E\u003Cp\u003E  I’m still working on Collegestuck right now (hopefully the next storyline should be written fully by Sunday), but I’m going to be interspersing those uploads with the story I wrote for my creative writing class last year. The topic of the class was \u0022Coming of age.\u0022\u003C/p\u003E\u003Cp\u003ECurrent plain is to serialize it on a Tuesday/Thursday schedule&mdash;leaving MWF free for collegestuck.\u003C/p\u003E\u003Cp\u003EEnjoy!\u003C/p\u003E",
    "content": "\u003Cp\u003EThe difference between the first day of the first and last years ofmiddle school is immense.  The start of your first year is the mostimportant day in your life, and the start of the last year is the mostunimportant.\u003C/p\u003E\u003Cp\u003EJoseph Warren had long since been through his first year of middleschool and was advising his younger sister, Rosie, on how to geteverything she could out of the first day of school, while theylounged on their living room couch.\u003C/p\u003E\u003Cp\u003E\u0022The last thing you want to do is glue yourself to the people youknew in elementary school.  The world is bigger than that now.\u0022\u003C/p\u003E\u003Cp\u003EJoe spoke with the authority of a professor that was giving a lectureon the most important branch of the physical sciences.  An impressionthat Rosie upheld with the rigid dedication of a Harvard student.\u003C/p\u003E\u003Cp\u003ERosie politely raised her hand, \u0022How do you reccomend meeting thesenew people?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Mostly through your classes,\u0022 Joe answered, \u0022I'd also advise onjoining at least one club.  I never did that, but everyone else tellsme that they made their best friends in some-club-or-other.\u0022\u003C/p\u003E\u003Cp\u003ERosie nodded in contemplation, carefully considering what her olderbrother said.\u003C/p\u003E\u003Cp\u003EJoe carried on with his lesson, \u0022Something that I undervalued backwhen I was starting out was showing up to classes.  I didn't think itwould be that hard to do&#x2014;\u0022\u003C/p\u003E\u003Cp\u003ERosie's eyes widened, \u0022You cut classes?\u0022\u003C/p\u003E\u003Cp\u003EJoe immediently backpedaled, \u0022Oh no no no no! I could never! Butdespite my pleading, all of my former friends succumbed to thedisease.\u0022\u003C/p\u003E\u003Cp\u003ERosie giggled, \u0022You're trying to make yourself sound smart again&#x2026;\u0022\u003C/p\u003E\u003Cp\u003EJoe rolled his eyes, \u0022It's to convey the importance of the things Ilearned by attending school, Rosie, I wanna make sure you stay ontrack to kick this school's ass both physically and timemanagement&#x2026;ly.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Nice one, bro\u0022\u003C/p\u003E\u003Cp\u003E\u0022Oh, shut up.  I was trying to tell you that you shouldn't cutclass!\u0022\u003C/p\u003E\u003Cp\u003ERosie rolled her eyes, all traces of a mock-professor/student dynamichaving faded into the mundanity of sibling dynamics.\u003C/p\u003E\u003Cp\u003E\u0022Anyways,\u0022 Joe continued, \u0022don't be an asshole to people you don'tknow.  It gets more blurry with your friends, but I'd reccomend notsaying anything too mean to them as well.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Joe, that is the most self-obvious piece of advice I've everheard,\u0022 Rosie said, \u0022is the next nugget gonna be \u0022don't murder yourteachers\u0022 or something like that.\u0022\u003C/p\u003E\u003Cp\u003EJoe snorted, \u0022Oh yeah, little miss swiping at my back when I'mpicking up my sword, you can be ruthless sometimes.\u0022h\u0022Only to people who deserve to know that what they said was asinineas hell,\u0022 Rosie said, \u0022and I apologized for the backstab already,Jesus Christ Joe.\u0022\u003C/p\u003E\u003Cp\u003EJoe grinned, \u0022Relax Rosie, I'm kidding.\u0022\u003C/p\u003E\u003Cp\u003EThere was a long pause as a look of worry knit itself across Rosie'sface.\u003C/p\u003E\u003Cp\u003ERosie sighed and finally spoke up, \u0022Hey Joe?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yeah?\u0022\u003C/p\u003E\u003Cp\u003EShe paused for a moment before continuing, \u0022Should I try to givemyself a new nickname? Rosie just feels so childish and youngsounding.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Uh,\u0022 Joe leaned back further into the couch's pile of pillows andblankets as if he could escape his uncertainty, \u0022I don't know.  Ikind of know where you're coming from, if that helps at all.  Joeisn't exactly the coolest name in the book, and Joey and Joseph aren'ta whole lot better.\u0022\u003C/p\u003E\u003Cp\u003EShe ran her fingers through her hair distractedly, \u0022Does it reallymatter what my nickname is? Am I over-thinking it?\u0022\u003C/p\u003E\u003Cp\u003EFrom the pillows, Joe said, \u0022I don't think it matters a whole lot,honestly.  I guess as long as you stay true to who you are andwhatever.  Names have power, but as long as the label you stick onyourself doesn't subsume your very \u0022\u003C/p\u003E\u003Cp\u003E\u0022Joe?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Yeah?\u0022\u003C/p\u003E\u003Cp\u003E\u0022That was the most incoherent self-indulgy monologue I've heard in along time.  Have you been thinking a lot about this?\u0022\u003C/p\u003E\u003Cp\u003E\u0022No,\u0022 Joe started, \u0022maybe.  I said it before, Joe is a bit of a lamename.  It gives the impression of a middle age football coach whopeaked in high-school.\u0022\u003C/p\u003E\u003Cp\u003E\u0022You're young, there's still time for that\u0022\u003C/p\u003E\u003Cp\u003EJoe got out of the cushions and half heartedly swiped at his sister.\u003C/p\u003E\u003Cp\u003E\u0022Shut up.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Never,\u0022 she said, \u0022anyways.  What about Rose?\u0022\u003C/p\u003E\u003Cp\u003E\u0022Huh? Oh right.\u0022\u003C/p\u003E\u003Cp\u003EJoe thought for a few moments before nodding his head in approval.\u003C/p\u003E\u003Cp\u003E\u0022I like Rose, it feels clever.\u0022\u003C/p\u003E\u003Cp\u003ERose beamed and said, \u0022Like me!\u0022\u003C/p\u003E\u003Cp\u003EJoe ignored the comment, \u0022Do you think I should take on a nicknametoo? I know its really too late to, but I've got a strange feelingthat I ought to, you know?\u0022\u003C/p\u003E\u003Cp\u003ERose considered her words carefully before speaking again, \u0022I thinkthat's a personal question, Joe.  Besides, its not really too late.You can always adopt a screenname, seperate from your own to useonline.\u0022\u003C/p\u003E\u003Cp\u003EJoe sighed and ran his hand through his hair.\u003C/p\u003E\u003Cp\u003E\u0022Yeah you're right,\u0022 Joe said, \u0022I'll leave it be for the year, andif I come up with an ingenious idea that'll blow everyone's minds withhow cool it is I'll use it next year.\u0022\u003C/p\u003E\u003Cp\u003ERose punched Joe's shoulder, and said, \u0022That's the spirit.  Justdon't forget your advice.  What was it? Don't let the nickname becomea mask that become all that you are or whatever that means.\u0022\u003C/p\u003E\u003Cp\u003E\u0022Oh shut up, Rosie.\u0022\u003C/p\u003E"
}
]
